espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/wisun/component/app_cli/sl_wisun_app_cli.c
// -----------------------------------------------------------------------------
//                          Public Function Definitions
// -----------------------------------------------------------------------------

void app_about(void)
{
  app_wisun_project_info_print(false);
}

/* Weak function for app_wisun_network_connect() if the app_core is not added. */
SL_WEAK void app_wisun_network_connect(void)
{
  assert("app_wisun_network_connect() is not implemented" == NULL);
}

/* CLI app connect handler */
void app_connect(sl_cli_command_arg_t *arguments)
{
  (void) arguments;
  app_wisun_cli_mutex_lock();
  app_wisun_network_connect();
  app_wisun_cli_mutex_unlock();
}

/* CLI app disconnect handler */
void app_disconnect(sl_cli_command_arg_t *arguments)
{
  sl_status_t ret;
  sl_wisun_join_state_t join_state = SL_WISUN_JOIN_STATE_DISCONNECTED;
  (void) arguments;

  app_wisun_cli_mutex_lock();

  ret = sl_wisun_get_join_state(&join_state);
  if (ret != SL_STATUS_OK) {
    printf("[Failed: Getting join state failed]\r\n");
    app_wisun_cli_mutex_unlock();
    return;
  }
  if (join_state == SL_WISUN_JOIN_STATE_DISCONNECTED) {
    printf("[Failed: already disconnected]\r\n");
    app_wisun_cli_mutex_unlock();
    return;
  }

  ret = sl_wisun_disconnect();
  if (ret == SL_STATUS_OK) {
    printf("[Disconnecting]\r\n");
  } else {
    printf("[Disconnection failed: %lu]\r\n", ret);
  }

  app_wisun_cli_mutex_unlock();
}

// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------

/* App CLI getting connection state (join state) */
static sl_status_t _app_cli_get_connection(char *value_str,
                                           const char *key_str,
                                           const app_cli_entry_t *entry)
{
  sl_status_t res = SL_STATUS_FAIL;
  uint32_t value;
  const app_enum_t* value_enum;
  (void)key_str;
  sl_wisun_join_state_t join_state = SL_WISUN_JOIN_STATE_DISCONNECTED;

  if ((value_str == NULL) || (entry == NULL)) {
    return SL_STATUS_FAIL;
  }

  // gets the connection state from the core
  res = sl_wisun_get_join_state(&join_state);
  if (res != SL_STATUS_OK) {
    return res;
  }
  value = (uint32_t)join_state;

  // finds the proper string for the value
  value_enum = entry->output_enum_list;

  if (value_enum->value_str != NULL) {
    while (value_enum) {
      if (value_enum->value == value) {
        // Matching enumeration found
        break;
      }
      value_enum++;
    }
  } else {
    return SL_STATUS_FAIL;
  }

  // creates the value string
  sprintf(value_str, "%s (%d)", value_enum->value_str, (uint8_t)value_enum->value);

  return SL_STATUS_OK;
}

/* App CLI setting network name */
static sl_status_t _app_cli_set_network_name(const char *value_str,
                                             const char *key_str,
                                             const app_cli_entry_t *entry)
{
  (void)key_str;
  (void)entry;

  return app_wisun_setting_set_network_name(value_str);
}

/* App CLI setting network size */
static sl_status_t _app_cli_set_network_size(const char *value_str,
                                             const char *key_str,
                                             const app_cli_entry_t *entry)
{
  (void)key_str;
  (void)entry;
  sl_status_t res = SL_STATUS_FAIL;
  uint32_t value = 0U;

  res = app_util_get_integer(&value,
                             value_str,
                             entry->input_enum_list,
                             entry->input & APP_CLI_INPUT_FLAG_SIGNED);
  if (res == SL_STATUS_OK) {
    // sets the network name
    res = app_wisun_setting_set_network_size((uint8_t*)&value);
  }

  return res;
}

/* App CLI setting tx power */
static sl_status_t _app_cli_set_tx_power(const char *value_str,
                                         const char *key_str,
                                         const app_cli_entry_t *entry)
{
  (void)key_str;
  (void)entry;
  sl_status_t res = SL_STATUS_FAIL;
  int32_t value = 0U;

  res = app_util_get_integer((uint32_t *)&value,
                             value_str,
                             entry->input_enum_list,
                             entry->input & APP_CLI_INPUT_FLAG_SIGNED);
  if (res == SL_STATUS_OK) {
    // sets the tx power
    res = app_wisun_setting_set_tx_power((int8_t*)&value);
  }

  return res;
}

/* App CLI setting network name */
static sl_status_t _app_cli_get_network_name(char *value_str,
                                             const char *key_str,
                                             const app_cli_entry_t *entry)
{
  sl_status_t res = SL_STATUS_FAIL;
  (void)key_str;
  (void)entry;
  char name_buffer[MAX_SIZE_OF_NETWORK_NAME] = { 0 };

  // gets the network name
  res = app_wisun_setting_get_network_name(name_buffer, sizeof(name_buffer));

  if (res == SL_STATUS_OK) {
    sprintf(value_str, "%s", name_buffer);
  }

  return res;
}

/* App CLI setting network size */
static sl_status_t _app_cli_get_network_size(char *value_str,
                                             const char *key_str,
                                             const app_cli_entry_t *entry)
{
  sl_status_t res = SL_STATUS_FAIL;
  (void)key_str;
  (void)entry;
  const app_enum_t* value_enum;
  uint8_t value = 0U;

  res = app_wisun_setting_get_network_size(&value);
  if (res == SL_STATUS_OK) {
    // finds the proper string for the value
    value_enum = entry->output_enum_list;

    if (value_enum->value_str != NULL) {
      while (value_enum) {
        if (value_enum->value == value) {
          // Matching enumeration found
          break;
        }
        value_enum++;
      }
    } else {
      return SL_STATUS_FAIL;
    }

    // creates the value string
    sprintf(value_str, "%s (%d)", value_enum->value_str, (uint8_t)value_enum->value);
  }

  return res;
}

/* App CLI setting tx power */
static sl_status_t _app_cli_get_tx_power(char *value_str,
                                         const char *key_str,
                                         const app_cli_entry_t *entry)
{
  sl_status_t res = SL_STATUS_FAIL;
  (void)key_str;
  (void)entry;
  int8_t value = 0U;

  res = app_wisun_setting_get_tx_power(&value);
  if (res == SL_STATUS_OK) {
    sprintf(value_str, "%d", value);
  } else {
    sprintf(value_str, "N/A");
  }

  return res;
}

/* App CLI getting PHY parameters */
static sl_status_t _app_cli_get_phy(char *value_str,
                                    const char *key_str,
                                    const app_cli_entry_t *entry)
{
  sl_status_t res = SL_STATUS_FAIL;
  const app_enum_t* value_enum;
  (void)key_str;
  app_setting_phy phy;

