espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/wisun/component/app_cli/sl_wisun_app_cli.c
  if ((value_str == NULL) || (entry == NULL) || (entry->key == NULL)) {
    return res;
  }

  // gets the wisun phy parameters
#if defined(SL_CATALOG_WISUN_FULL_RADIOCONF_PRESENT)
  res = app_wisun_setting_get_phy(&phy);
#else
  res = sl_wisun_util_get_rf_settings(&phy.regulatory_domain, &phy.operating_class,
                                      &phy.operating_mode);
#endif
  if (res != SL_STATUS_OK) {
    return res;
  }

  // regulatory domain
  if (strstr(entry->key, "regulatory_domain")) {
    // finds the proper string for the value for regulatory domain
    value_enum = entry->output_enum_list;

    if (value_enum->value_str != NULL) {
      while (value_enum) {
        if (value_enum->value == phy.regulatory_domain) {
          // Matching enumeration found
          break;
        }
        value_enum++;
      }
    } else {
      return SL_STATUS_FAIL;
    }
    sprintf(value_str, "%s (%d)", value_enum->value_str, (uint8_t)value_enum->value);
    // operating class
  } else if (strstr(entry->key, "operating_class")) {
    sprintf(value_str, "%d", phy.operating_class);
    // operating mode
  } else if (strstr(entry->key, "operating_mode")) {
    sprintf(value_str, "0x%x", phy.operating_mode);
  }

  return SL_STATUS_OK;
}

#if defined(SL_CATALOG_WISUN_FULL_RADIOCONF_PRESENT)
/* App CLI getting PHY parameters */
sl_status_t _app_cli_set_phy(const char *value_str,
                             const char *key_str,
                             const app_settings_entry_t *entry)
{
  (void)key_str;
  sl_status_t res = SL_STATUS_FAIL;
  int32_t value = 0U;
  const app_enum_t* value_enum;
  app_setting_phy phy;

  if ((value_str == NULL) || (entry == NULL) || (entry->key == NULL)) {
    return res;
  }

  app_wisun_setting_get_phy(&phy);

  res = app_util_get_integer((uint32_t *)&value,
                             value_str,
                             entry->input_enum_list,
                             entry->input & APP_SETTINGS_INPUT_FLAG_SIGNED);
  if (res != SL_STATUS_OK) {
    return res;
  }

  if (strstr(entry->key, "regulatory_domain")) {
    value_enum = entry->output_enum_list;
    value_enum += value;
    phy.regulatory_domain = value;
    app_wisun_setting_set_phy(&phy);
  } else if (strstr(entry->key, "operating_class")) {
    phy.operating_class = value;
    app_wisun_setting_set_phy(&phy);
  } else if (strstr(entry->key, "operating_mode")) {
    phy.operating_mode = value;
    app_wisun_setting_set_phy(&phy);
  } else {
  }
  return res;
}
#endif

#if defined(SL_CATALOG_WISUN_MODE_SWITCH_PRESENT)
/* App CLI getting mode switch counters */
static sl_status_t _app_ms_get_counters(char *value_str,
                                        const char *key_str,
                                        const app_cli_entry_t *entry)
{
  sl_status_t res = SL_STATUS_FAIL;
  (void)key_str;
  sl_wisun_statistics_t stat;

  if ((value_str == NULL) || (entry == NULL) || (entry->key == NULL)) {
    return res;
  }

  // gets the statsitic that contains the mode switch information
  res = sl_wisun_get_statistics(SL_WISUN_STATISTICS_TYPE_MAC, &stat);

  if (res != SL_STATUS_OK) {
    return res;
  }

  // mode switch TX-RX counters (inc. failed)
  if (strstr(entry->key, "mode_switch_tx_counter")) {
    sprintf(value_str, "%lu", stat.mac.tx_ms_count);
  } else if (strstr(entry->key, "mode_switch_tx_failed_counter")) {
    sprintf(value_str, "%lu", stat.mac.tx_ms_failed_count);
  } else if (strstr(entry->key, "mode_switch_rx_counter")) {
    sprintf(value_str, "%lu", stat.mac.rx_ms_count);
  } else if (strstr(entry->key, "mode_switch_rx_failed_counter")) {
    sprintf(value_str, "%lu", stat.mac.rx_ms_failed_count);
  } else {
  }

  return SL_STATUS_OK;
}
#endif

static sl_status_t _app_set_regulation(const char *value_str,
                                       const char *key_str,
                                       const app_settings_entry_t *entry)
{
  (void)key_str;
  (void)entry;
  sl_status_t res = SL_STATUS_FAIL;
  uint32_t value = 0U;
  regulation_thresholds_t thresholds;
  sl_wisun_join_state_t join_state = SL_WISUN_JOIN_STATE_DISCONNECTED;

  if ((value_str == NULL) || (entry == NULL) || (entry->key == NULL)) {
    return SL_STATUS_FAIL;
  }

  // checking if the device connected or not
  res = sl_wisun_get_join_state(&join_state);
  if (res != SL_STATUS_OK) {
    return res;
  } else {
    if (join_state != SL_WISUN_JOIN_STATE_DISCONNECTED) {
      printf("[Regulation related settings unavailable, disconnection is needed]\r\n");
      return SL_STATUS_FAIL;
    }
  }

  res = app_util_get_integer(&value,
                             value_str,
                             entry->input_enum_list,
                             entry->input & APP_CLI_INPUT_FLAG_SIGNED);

  if (res != SL_STATUS_OK) {
    printf("[Failed: Get value error: %lu]\r\n", res);
    return res;
  }

  if (strstr(entry->key, "regulation")) {
    // sets the thresholds
    (void)app_wisun_get_regulation_thresholds(&thresholds);
    res = sl_wisun_set_regulation_tx_thresholds(thresholds.warning_threshold,
                                                thresholds.alert_threshold);
    if (res != SL_STATUS_OK) {
      printf("[Failed: unable to set regulation TX thresholds: %lu]\r\n", res);
      return res;
    }

    // sets regulation
    res = sl_wisun_set_regulation((sl_wisun_regulation_t)value);
    if (res != SL_STATUS_OK) {
      printf("[Regulation not valid]\n");
      return res;
    } else {
      app_regulation = (sl_wisun_regulation_t)value;
    }

    // sets status of regulation
    if ((sl_wisun_regulation_t)value == SL_WISUN_REGULATION_NONE) {
      app_wisun_set_regulation_active(false);
    } else {
      app_wisun_set_regulation_active(true);
    }
  }

  return SL_STATUS_OK;
}

static sl_status_t _app_set_regulation_warning_threshold(const char *value_str,
                                                         const char *key_str,
                                                         const app_settings_entry_t *entry)
{
  (void)key_str;
  (void)entry;
  sl_status_t res = SL_STATUS_FAIL;
  uint32_t value = 0U;
  regulation_thresholds_t thresholds;
  sl_wisun_join_state_t join_state = SL_WISUN_JOIN_STATE_DISCONNECTED;

